depot/app/controllers/admin_controller.rb

  def index
    @total_orders = Order.count
---
SELECT count(*) AS count_all FROM "orders"