depot/app/controllers/store_controller.rb

  def index
    @products = Product.find_products_for_sale
---
SELECT * FROM "products" ORDER BY title

  def add_to_cart
    product = Product.find(params[:id])
---
SELECT * FROM "products" WHERE ("products"."id" = 3)

  def save_order
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save
---
INSERT INTO "line_items" ("created_at", "product_id", "quantity", "order_id", "total_price", "updated_at") VALUES('2009-05-12 14:45:31', 3, 1, 1, 29.95, '2009-05-12 14:45:31')
INSERT INTO "orders" ("name", "address", "created_at", "updated_at", "pay_type", "email") VALUES('MH', 'MH', '2009-05-12 14:45:31', '2009-05-12 14:45:31', 'check', 'MH')