depot/app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 4) LIMIT 1
---
  def index
    @users = User.find(:all, :order => :name)

SELECT * FROM "users" WHERE ("users"."id" = 1)
---
  def edit
    @user = User.find(params[:id])

INSERT INTO "users" ("name", "salt", "created_at", "updated_at", "hashed_password") VALUES('test', '-6200234380.286801549427852', '2009-05-12 16:24:17', '2009-05-12 16:24:17', 'e51b00cfec913f32b7f9d9954b41dc4ca9e78e04')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 2)
UPDATE "users" SET "updated_at" = '2009-05-12 16:28:05', "name" = 'test12' WHERE "id" = 2
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])